# St7SetNodeID

Sets the ID number of the specified node.

long St7SetNodeID(long uID, long NodeNum, long NodeID)

Input Parameters

uID

Strand7 model file ID.

NodeNum

Node number.

NodeID

ID number for the specified node.